const schedulesData = {
    "КН-31": {
        "faculty": "ФМФІТ",
        "date_range": "10.02.2025 - 01.07.2025",
        "schedule": [
            {
                "date": "10.02.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.02.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 301 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "12.02.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.02.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "14.02.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "17.02.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.02.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.02.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "",
                        "link": "http://meet.google.com/emj-cmiw-tqm"
                    }
                ]
            },
            {
                "date": "20.02.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 33 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://us05web.zoom.us/j/7922695917?pwd=J7Xltt4n7aUKvfNYnxba8lRodSX0LD.1"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://us05web.zoom.us/j/7922695917?pwd=J7Xltt4n7aUKvfNYnxba8lRodSX0LD.1"
                    }
                ]
            },
            {
                "date": "21.02.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "24.02.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-31 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "25.02.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "26.02.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "",
                        "link": "http://meet.google.com/emj-cmiw-tqm"
                    }
                ]
            },
            {
                "date": "27.02.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://us05web.zoom.us/j/7922695917?pwd=J7Xltt4n7aUKvfNYnxba8lRodSX0LD.1"
                    }
                ]
            },
            {
                "date": "28.02.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "",
                        "link": "http://meet.google.com/emj-cmiw-tqm"
                    }
                ]
            },
            {
                "date": "06.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://us05web.zoom.us/j/7922695917?pwd=J7Xltt4n7aUKvfNYnxba8lRodSX0LD.1"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    }
                ]
            },
            {
                "date": "07.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "10.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-31 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "12.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "",
                        "link": "http://meet.google.com/emj-cmiw-tqm"
                    }
                ]
            },
            {
                "date": "13.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://us05web.zoom.us/j/7922695917?pwd=J7Xltt4n7aUKvfNYnxba8lRodSX0LD.1"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    }
                ]
            },
            {
                "date": "14.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "17.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 403 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "20.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (Л)",
                        "teacher": "Дудкевич В.І.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://us05web.zoom.us/j/7922695917?pwd=J7Xltt4n7aUKvfNYnxba8lRodSX0LD.1"
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    }
                ]
            },
            {
                "date": "21.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://meet.google.com/uvz-phzq-qaf"
                    }
                ]
            },
            {
                "date": "24.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-31 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "25.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "26.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "",
                        "link": "http://meet.google.com/emj-cmiw-tqm"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "27.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    }
                ]
            },
            {
                "date": "28.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://meet.google.com/uvz-phzq-qaf"
                    }
                ]
            },
            {
                "date": "31.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "01.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "дист.",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "https://meet.google.com/mka-xhtg...",
                        "link": "http://meet.google.com/emj-cmiw-tqm"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    }
                ]
            },
            {
                "date": "04.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://meet.google.com/uvz-phzq-qaf"
                    }
                ]
            },
            {
                "date": "07.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "08.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "09.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "дист.",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "",
                        "link": "http://meet.google.com/emj-cmiw-tqm"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "10.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    }
                ]
            },
            {
                "date": "11.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://meet.google.com/uvz-phzq-qaf"
                    }
                ]
            },
            {
                "date": "16.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "дист.",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (КСР)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "",
                        "link": "http://meet.google.com/emj-cmiw-tqm"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "17.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    }
                ]
            },
            {
                "date": "22.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "23.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "дист.",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-...",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (Л)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "дист.",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "24.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    }
                ]
            },
            {
                "date": "25.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://meet.google.com/uvz-phzq-qaf"
                    }
                ]
            },
            {
                "date": "28.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-31 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31",
                        "details": "ауд. 324 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "29.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "30.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "http://meet.google.com/emj-cmiw-tqm"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "01.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-31 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "06.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "07.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "дист.",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-...",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "08.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    }
                ]
            },
            {
                "date": "09.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://meet.google.com/uvz-phzq-qaf"
                    }
                ]
            },
            {
                "date": "12.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-31 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31",
                        "details": "ауд. 324 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "14.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "дист.",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-...",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "15.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    }
                ]
            },
            {
                "date": "16.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "КН-31 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31",
                        "details": "ауд. 316 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "20.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "21.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (ПрС)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "дист.",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "http://meet.google.com/emj-cmiw-...",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "22.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "23.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група SS-зб4 Soft skills у професійній діяльності (ПрС)",
                        "teacher": "Матвієнків С.М.",
                        "group": "SS-зб4",
                        "details": "",
                        "link": "https://meet.google.com/uvz-phzq-qaf"
                    }
                ]
            },
            {
                "date": "26.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-31 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31",
                        "details": "ауд. 324 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "27.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "28.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (ПрС)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "",
                        "link": "http://meet.google.com/emj-cmiw-tqm"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "29.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПтаРС-зб1 Інноваційне підприємництво та розвиток стартапів (Л)",
                        "teacher": "Паска Ю.В.",
                        "group": "ІПтаРС-зб1",
                        "details": "",
                        "link": "https://meet.google.com/gqw-tsfv-ntg"
                    }
                ]
            },
            {
                "date": "30.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.06.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.06.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.06.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ТМ-зб6 Тайм- менеджмент (КСР)",
                        "teacher": "Колєдіна К.О.",
                        "group": "ТМ-зб6",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.06.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-31 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "06.06.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-31 Аналіз даних... Письм.Екз.- за групу (КЕк)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 316 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "09.06.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-31 Аналіз даних... Письм.Екз.- за групу (Екз)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-31 Практикум з програмування... Письм.Екз.- за групу (КЕк)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.06.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "КН-31 Практикум з програмування... Письм.Екз.- за групу (Екз)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-31 Комп`ютерні мережі... Письм.Екз.- за групу (КЕк)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.06.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-31 Комп`ютерні мережі... Письм.Екз.- за групу (Екз)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            }
        ]
    },
    "КН-32": {
        "faculty": "ФМФІТ",
        "date_range": "10.02.2025 - 01.07.2025",
        "schedule": [
            {
                "date": "10.02.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.02.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 301 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "12.02.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.02.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    }
                ]
            },
            {
                "date": "14.02.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "17.02.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-32",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.02.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.02.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "20.02.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 33 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 35 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "21.02.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "24.02.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "25.02.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "26.02.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "27.02.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (Л)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": "https://meet.google.com/khj-wrua-nrk"
                    }
                ]
            },
            {
                "date": "28.02.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-32",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "06.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (Л)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "07.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "10.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "12.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (Л)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "14.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "17.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 403 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-32",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (Л)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (ПрС)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "20.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (Л)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "21.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "24.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "25.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "26.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "27.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (Л)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "28.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "31.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-32",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (Л)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": "https://us02web.zoom.us/j/2734646154"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (ПрС)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "01.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 320а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (Л)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "07.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (ПрС)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "08.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "09.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "10.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (ПрС)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група Уфсо-3зб Соціологія (ПрС)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "14.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (Л)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (ПрС)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "16.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "17.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (ПрС)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "21.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (ПрС)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "22.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "23.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік КН-31, КН-32 Аналіз даних (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.19 Технології проектування комп’ютерних ігор (Unity) (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.19",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (ПрС)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "24.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (ПрС)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "25.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "28.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (Л)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": "https://us02web.zoom.us/j/2734646154"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (ПрС)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "29.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "30.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "01.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (ПрС)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-32",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (ПрС)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "06.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "07.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Л)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "08.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.32 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.32",
                        "details": "ауд. 234 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.29 Крос-платформне програмування (Python) (Л)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.29",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Операційні системи (Л)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "(підгр. 2) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (ПрС)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "09.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Комп`ютерні мережі (Л)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "12.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.31 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.31",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік КН-31, КН-32 Економіка (Л)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-31, КН-32",
                        "details": "ауд. 318 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.30 Крос-платформне програмування (Python) (Лаб)",
                        "teacher": "Семаньків М.В.",
                        "group": "КН(зб)2.30",
                        "details": "ауд. 230 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (Л)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": "https://us02web.zoom.us/j/2734646154"
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (ПрС)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 112 кор. Гуманітарний корпус",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "14.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 1) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-32",
                        "details": "ауд. 232 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "15.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (ПрС)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група ІПЗ(3‚4)зб Лідерство та ефективне управління (Л)",
                        "teacher": "Мендела І.Я.",
                        "group": "ІПЗ(3‚4)зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "16.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 322 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-32",
                        "details": "ауд. 402 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "20.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "21.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "(підгр. 2) Комп`ютерні мережі (Лаб)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "22.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 2) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (ПрС)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "23.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Л)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 310 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "27.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 320 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Л)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.22 Технології розробки мобільних додатків (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.22",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "28.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.28 Алгоритми на графах (Лаб)",
                        "teacher": "Никифорчин О.Р.",
                        "group": "КН(зб)2.28",
                        "details": "ауд. 404 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Економіка (Сем)",
                        "teacher": "Кушнір О.С.",
                        "group": "КН-32",
                        "details": "ауд. 232 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.20 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.20",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "16:50-18:10",
                        "subject": "Збірна група КН(зб)2.21 Технології проектування комп’ютерних ігор (Unity) (Лаб)",
                        "teacher": "Горєлов В.О.",
                        "group": "КН(зб)2.21",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "19:40-21:00",
                        "subject": "Збірна група BE-зб5 Business English (ПрС)",
                        "teacher": "Туровська Л.В.",
                        "group": "BE-зб5",
                        "details": "",
                        "link": "https://meet.google.com/mka-xhtg-idk"
                    }
                ]
            },
            {
                "date": "29.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 309а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307а кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "Збірна група КН(зб)2.23 WEB - програмування (JavaScript) (Л)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.23",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "18:15-19:35",
                        "subject": "Збірна група Уфсо-3зб Соціологія (ПрС)",
                        "teacher": "Кучера І.В.",
                        "group": "Уфсо-3зб",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "30.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.27 Програмування iOS (Лаб)",
                        "teacher": "Ровінський В.А.",
                        "group": "КН(зб)2.27",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.06.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.06.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.06.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група КН(зб)2.24 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.24",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група КН(зб)2.25 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.25",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група КН(зб)2.26 WEB - програмування (JavaScript) (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН(зб)2.26",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.06.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "(підгр. 1) Операційні системи (Лаб)",
                        "teacher": "Никорак Я.Я.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "(підгр. 1) Аналіз даних (Лаб)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "06.06.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-32 Практикум з програмування (ПрС)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 207 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "КН-32 Комп`ютерні мережі... Письм.Екз.- за групу (КЕк)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.06.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-32 Комп`ютерні мережі... Письм.Екз.- за групу (Екз)",
                        "teacher": "Превисокова Н.В.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.06.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-32 Аналіз даних... Письм.Екз.- за групу (КЕк)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 313 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "16.06.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "КН-32 Аналіз даних... Письм.Екз.- за групу (Екз)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 309 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-32 Практикум з програмування... Письм.Екз.- за групу (КЕк)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 306 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            },
            {
                "date": "20.06.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "12:20-13:40",
                        "subject": "КН-32 Практикум з програмування... Письм.Екз.- за групу (Екз)",
                        "teacher": "Ізмайлов А.В.",
                        "group": "КН-32",
                        "details": "ауд. 307 кор. Центральний корпус, Шевченка 57",
                        "link": ""
                    }
                ]
            }
        ]
    },
    "ПР-35": {
        "faculty": "Факультет Права",
        "date_range": "10.02.2025 - 01.07.2025",
        "schedule": [
            {
                "date": "17.02.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(юркл)л Юридична клінічна освіта (Л)",
                        "teacher": "Костів І.Я.",
                        "group": "ПР(юркл)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне право України (Л)",
                        "teacher": "Медицький І.Б.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група ПР(захтр)л Захист трудових прав працівників (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.02.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 402 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група ПР(юркл)л Юридична клінічна освіта (Л)",
                        "teacher": "Костів І.Я.",
                        "group": "ПР(юркл)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.02.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(захтр)л Захист трудових прав працівників (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне право України (Л)",
                        "teacher": "Медицький І.Б.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(псз)л Право соціального забезпечення (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "20.02.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 309 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне право України (Л)",
                        "teacher": "Банасевич І.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "21.02.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (Л)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 308 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 309 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне право України (Л)",
                        "teacher": "Банасевич І.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "24.02.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(квп)л Кримінально-виконавче право (Л)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": "http://meet.google.com/smf-qirh-bsu"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне право України (Л)",
                        "teacher": "Медицький І.Б.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/imo-ubqj-deu"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "дист., ауд. 308 кор. Шевченка, 44а",
                        "link": "https://teams.live.com/meet/9475689210338?p=GTM9yrN2TMzpejehHN"
                    }
                ]
            },
            {
                "date": "25.02.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне право України (Л)",
                        "teacher": "Банасевич І.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 402 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/bht-veak-xce"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": "http://meet.google.com/trk-hyds-cvb"
                    }
                ]
            },
            {
                "date": "26.02.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "дист., ауд. 208 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/ujs-muse-asm"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "дист., ауд. 113 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/xsg-figs-sta"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 406 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/iog-jjji-jpk"
                    }
                ]
            },
            {
                "date": "27.02.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(псз)л Право соціального забезпечення (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": "http://meet.google.com/vtx-pwtq-yae"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група ПР(квп)л Кримінально-виконавче право (Л)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": "http://meet.google.com/smf-qirh-bsu"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(захтр)4 Захист трудових прав працівників (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)4",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": "http://meet.google.com/vtx-pwtq-yae"
                    }
                ]
            },
            {
                "date": "28.02.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (ПрС)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 103 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/xzw-mwwn-mkd"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне право України (Л)",
                        "teacher": "Банасевич І.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 402 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/bht-veak-xce"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": "http://meet.google.com/trk-hyds-cvb"
                    }
                ]
            },
            {
                "date": "03.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПРЮрКл1 Юридична клінічна освіта (ПрС)",
                        "teacher": "Костів І.Я.",
                        "group": "ПРЮрКл1",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/gxz-makp-mne"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне право України (Л)",
                        "teacher": "Медицький І.Б.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/imo-ubqj-deu"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "дист., ауд. 308 кор. Шевченка, 44а",
                        "link": "https://teams.live.com/meet/9475689210338?p=GTM9yrN2TMzpejehHN"
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група ПР(псз)л Право соціального забезпечення (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": "http://meet.google.com/vtx-pwtq-yae"
                    }
                ]
            },
            {
                "date": "04.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(псз)1 Право соціального забезпечення (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)1",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": "http://meet.google.com/vtx-pwtq-yae"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне право України (Л)",
                        "teacher": "Банасевич І.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/bht-veak-xce"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": "http://meet.google.com/trk-hyds-cvb"
                    }
                ]
            },
            {
                "date": "05.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "дист., ауд. 209 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/ujs-muse-asm"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "дист., ауд. 114 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/xsg-figs-sta"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 406 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/iog-jjji-jpk"
                    }
                ]
            },
            {
                "date": "06.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(юркл)л Юридична клінічна освіта (Л)",
                        "teacher": "Костів І.Я.",
                        "group": "ПР(юркл)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/gxz-makp-mne"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "дист., ауд. 113 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/ujs-muse-asm"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(квп)4 Кримінально-виконавче право (ПрС)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)4",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": "http://meet.google.com/smf-qirh-bsu"
                    }
                ]
            },
            {
                "date": "07.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (Л)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 308 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/xzw-mwwn-mkd"
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "дист., ауд. 114 кор. Шевченка, 44а",
                        "link": "https://meet.google.com/kka-yhcq-zdj"
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "дист., ауд. 404 кор. Шевченка, 44а",
                        "link": "https://teams.live.com/meet/9475689210338?p=GTM9yrN2TMzpejehHN"
                    }
                ]
            },
            {
                "date": "10.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(захтр)л Захист трудових прав працівників (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)л",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне право України (Л)",
                        "teacher": "Медицький І.Б.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 308 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне право України (Л)",
                        "teacher": "Банасевич І.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 402 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "12.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 208 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 406 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(псз)л Право соціального забезпечення (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група ПР(квп)л Кримінально-виконавче право (Л)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(захтр)4 Захист трудових прав працівників (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)4",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "14.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (ПрС)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 304 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "17.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПРЮрКл1 Юридична клінічна освіта (ПрС)",
                        "teacher": "Костів І.Я.",
                        "group": "ПРЮрКл1",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне право України (Л)",
                        "teacher": "Медицький І.Б.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "18.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(псз)1 Право соціального забезпечення (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)1",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне право України (Л)",
                        "teacher": "Банасевич І.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 206 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 406 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "20.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(юркл)л Юридична клінічна освіта (Л)",
                        "teacher": "Костів І.Я.",
                        "group": "ПР(юркл)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група ПР(захтр)4 Захист трудових прав працівників (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)4",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(квп)4 Кримінально-виконавче право (ПрС)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)4",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "21.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (Л)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 308 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "24.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(захтр)л Захист трудових прав працівників (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)л",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне право України (Л)",
                        "teacher": "Медицький І.Б.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "25.03.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне право України (Л)",
                        "teacher": "Банасевич І.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 402 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "26.03.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 406 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 206 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "27.03.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(псз)л Право соціального забезпечення (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група ПР(квп)л Кримінально-виконавче право (Л)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(захтр)4 Захист трудових прав працівників (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)4",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група ПР(захтр)л Захист трудових прав працівників (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)л",
                        "details": "ауд. 406 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "28.03.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (ПрС)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "31.03.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПРЮрКл1 Юридична клінічна освіта (ПрС)",
                        "teacher": "Костів І.Я.",
                        "group": "ПРЮрКл1",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне право України (Л)",
                        "teacher": "Медицький І.Б.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (Л)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 308 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "01.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне право України (Л)",
                        "teacher": "Банасевич І.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(юркл)л Юридична клінічна освіта (Л)",
                        "teacher": "Костів І.Я.",
                        "group": "ПР(юркл)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(квп)4 Кримінально-виконавче право (ПрС)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)4",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (Л)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 308 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 101 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "07.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне право України (Л)",
                        "teacher": "Медицький І.Б.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "08.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне право України (Л)",
                        "teacher": "Банасевич І.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 402 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (Л)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "09.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 208 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 406 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "10.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група ПР(квп)л Кримінально-виконавче право (Л)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)л",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "11.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (ПрС)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 101 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "14.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(юркл)1 Юридична клінічна освіта (КСР)",
                        "teacher": "Костів І.Я.",
                        "group": "ПР(юркл)1",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (КСР)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 0-102 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "15.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група ПР(квп)4 Кримінально-виконавче право (КСР)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)4",
                        "details": "ауд. 211 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне процесуальне право України (КСР)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 310 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група ПР(захтр)4 Захист трудових прав працівників (КСР)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)4",
                        "details": "ауд. 308 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "15:20-16:40",
                        "subject": "ПР-35 Кримінальне право України (КСР)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 308 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "16.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (КСР)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 103 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне право України (КСР)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 211 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(псз)1 Право соціального забезпечення (КСР)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)1",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "22.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(псз)1 Право соціального забезпечення (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)1",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне право України (Л)",
                        "teacher": "Банасевич І.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 402 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "23.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне право України (Л)",
                        "teacher": "Медицький І.Б.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 309 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "24.04.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(захтр)4 Захист трудових прав працівників (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)4",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "25.04.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(юркл)л Юридична клінічна освіта (Л)",
                        "teacher": "Костів І.Я.",
                        "group": "ПР(юркл)л",
                        "details": "ауд. 308 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 101 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "28.04.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПРЮрКл1 Юридична клінічна освіта (ПрС)",
                        "teacher": "Костів І.Я.",
                        "group": "ПРЮрКл1",
                        "details": "ауд. 208 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне право України (Л)",
                        "teacher": "Медицький І.Б.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 304 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "29.04.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(квп)4 Кримінально-виконавче право (ПрС)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)4",
                        "details": "ауд. 211 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 309 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Кримінальне процесуальне право України (Л)",
                        "teacher": "Микитин Ю.І.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 406 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "30.04.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група ПР(псз)1 Право соціального забезпечення (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)1",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Потік ПР-31, ПР-32, ПР-33, ПР-34, ПР-35 Цивільне процесуальне право України (Л)",
                        "teacher": "Кузьмич О.Я.",
                        "group": "ПР-31, ПР-32, ПР-33, ПР-34, ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "01.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(захтр)4 Захист трудових прав працівників (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)4",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(захтр)л Захист трудових прав працівників (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)л",
                        "details": "ауд. 308 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "05.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПРЮрКл1 Юридична клінічна освіта (ПрС)",
                        "teacher": "Костів І.Я.",
                        "group": "ПРЮрКл1",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 406 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(квп)л Кримінально-виконавче право (Л)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)л",
                        "details": "ауд. 309 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група ПР(захтр)4 Захист трудових прав працівників (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)4",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "06.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(псз)1 Право соціального забезпечення (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)1",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 402 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "07.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "08.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(квп)4 Кримінально-виконавче право (ПрС)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)4",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група ПР(псз)1 Право соціального забезпечення (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)1",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "09.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (ПрС)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 111 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 206 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "12.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПРЮрКл1 Юридична клінічна освіта (ПрС)",
                        "teacher": "Костів І.Я.",
                        "group": "ПРЮрКл1",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 304 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "13.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(псз)1 Право соціального забезпечення (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)1",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 103 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група ПР(псз)л Право соціального забезпечення (Л)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)л",
                        "details": "",
                        "link": ""
                    }
                ]
            },
            {
                "date": "14.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група ПР(квп)4 Кримінально-виконавче право (ПрС)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)4",
                        "details": "ауд. 111 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "15.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(захтр)4 Захист трудових прав працівників (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)4",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "16.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (ПрС)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 111 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 206 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 309 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "19.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПРЮрКл1 Юридична клінічна освіта (ПрС)",
                        "teacher": "Костів І.Я.",
                        "group": "ПРЮрКл1",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 304 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "20.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(псз)1 Право соціального забезпечення (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)1",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 103 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "21.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 309 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 406 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "22.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(квп)4 Кримінально-виконавче право (ПрС)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)4",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "23.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (ПрС)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 111 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 206 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 309 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "26.05.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПРЮрКл1 Юридична клінічна освіта (ПрС)",
                        "teacher": "Костів І.Я.",
                        "group": "ПРЮрКл1",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 304 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "27.05.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПР(псз)1 Право соціального забезпечення (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(псз)1",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 103 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "28.05.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "Збірна група ПР(квп)4 Кримінально-виконавче право (ПрС)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)4",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "29.05.2025",
                "day": "Четвер",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "Збірна група ПРЮрКл1 Юридична клінічна освіта (ПрС)",
                        "teacher": "Костів І.Я.",
                        "group": "ПРЮрКл1",
                        "details": "ауд. 113 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(захтр)4 Захист трудових прав працівників (ПрС)",
                        "teacher": "Кохан Н.В.",
                        "group": "ПР(захтр)4",
                        "details": "ауд. 407 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (ПрС)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 103 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "30.05.2025",
                "day": "П'ятниця",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 206 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 304 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "02.06.2025",
                "day": "Понеділок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 208 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 304 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "ПР-35 Кримінальне процесуальне право України (ПрС)",
                        "teacher": "Гнідан Р.М.",
                        "group": "ПР-35",
                        "details": "ауд. 111 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "03.06.2025",
                "day": "Вівторок",
                "lessons": [
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 103 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "Збірна група ПР(квп)4 Кримінально-виконавче право (ПрС)",
                        "teacher": "Кернякевич-Танасійчук Ю.В.",
                        "group": "ПР(квп)4",
                        "details": "ауд. 103 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "13:50-15:10",
                        "subject": "Збірна група ПР(викпр) Виконавче провадження (ПрС)",
                        "teacher": "Логвінова М.В.",
                        "group": "ПР(викпр)",
                        "details": "ауд. 111 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            },
            {
                "date": "04.06.2025",
                "day": "Середа",
                "lessons": [
                    {
                        "time": "09:00-10:20",
                        "subject": "ПР-35 Цивільне право України (ПрС)",
                        "teacher": "Схаб-Бучинська Т.Я.",
                        "group": "ПР-35",
                        "details": "ауд. 209 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "10:35-11:55",
                        "subject": "ПР-35 Цивільне процесуальне право України (ПрС)",
                        "teacher": "Петечел Н.М.",
                        "group": "ПР-35",
                        "details": "ауд. 114 кор. Шевченка, 44а",
                        "link": ""
                    },
                    {
                        "time": "12:20-13:40",
                        "subject": "ПР-35 Кримінальне право України (ПрС)",
                        "teacher": "Шпіляревич В.В.",
                        "group": "ПР-35",
                        "details": "ауд. 404 кор. Шевченка, 44а",
                        "link": ""
                    }
                ]
            }
        ]
    }
};

